package fivthWeek;

// Дана изначальная строка s. За одну операцию можно:
// -Взять непустой префикс строки состоящий из одинаковых букв.
// -Взять непустой суффикс строки состоящий из одинаковых букв.
// -И префикс, и суффикс должны состоять из одних и тех же букв.
// -Префикс и суффикс не должны пересекаться по символам.
// -Префикс и суффикс не обязательно равной длины.
// -Удалить полученные префикс и суффикс из строки.
// Посчитайте длину минимальной строки, которую можно получить из изначальной,
// после применения некоторого числа данных операций (возможно нуля).

// Формат ввода
// В единственной строке вводится изначальная строка s (1 ≤ ∣∣s∣∣ ≤ 10^5).
// Строка состоит из строчных букв латинского алфавита.

// Формат вывода
// В качестве ответа выведите единственное число — минимальную возможную длину строки после применения некоторого числа операций.

import java.util.Scanner;

public class DeleteString {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        String s = in.nextLine();

    }
}
